// --- NEROKING.COM ------------------------------------------------------------------------------------------------------------------------------------------------------- //

/// <summary> 指针事件类型 </summary>
public enum PointerEventType {

    /// <summary> 滑入 </summary>
    Enter = 0,

    /// <summary> 滑出 </summary>
    Exit = 1,

    /// <summary> 按下 </summary>
    Down = 2,

    /// <summary> 松开 </summary>
    Up = 3,

    /// <summary> 点击 </summary>
    Click = 4,

    /// <summary> 拖拽 </summary>
    Drag = 5,

    /// <summary> 覆盖 </summary>
    Cover = 6

}

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------ //