// --- NEROKING.COM ------------------------------------------------------------------------------------------------------------------------------------------------------- //

using static TraceTool;
using UnityEngine;
using System;
using System.Collections.Generic;

/// <summary> 指针事件数据 </summary>
public struct PointerData {

    // --- Field & Property ----------------------------------------------------------------------------------------------------------------------------------------------- //

    /// <summary> 指针输入类型 </summary>
    public PointerInputType InputType;

    /// <summary> 指针事件类型 </summary>
    public PointerEventType EventType;

    /// <summary> 指针 ID ( 大于等于 0 为 Touch ID，-1 为鼠标左键，-2 为鼠标右键，-3 为鼠标中键 )</summary>
    public int PointerID;

    /// <summary> 触发事件时指针的 X 坐标 </summary>
    public int X;

    /// <summary> 触发事件时指针的 Y 坐标 </summary>
    public int Y;

    // --- Public & Protected Function ------------------------------------------------------------------------------------------------------------------------------------ //

    // --- Internal Function ---------------------------------------------------------------------------------------------------------------------------------------------- //

    // --- Private Function ----------------------------------------------------------------------------------------------------------------------------------------------- //

}

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------ //