// --- NERO ABYSS. -------------------------------------------------------------------------------------------------------------------------------------------------------- //

/// <summary> 套接字频道事件类型 </summary>
public enum SocketChannelEventType {

    /// <summary> 套接字频道连接完成 </summary>
    ConnectionCompleted = 0,

    /// <summary> 套接字频道连接失败 </summary>
    ConnectionFailed = 1,

    /// <summary> 套接字频道已断开 </summary>
    Disconnected = 2

}

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------------ //